{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "go_backwards": false, "units": 8, "bias_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "implementation": 1, "return_sequences": false, "recurrent_constraint": null, "recurrent_regularizer": null, "batch_input_shape": [1, 1, 8], "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "unroll": false, "use_bias": true, "dtype": "float32", "stateful": true, "kernel_constraint": null, "name": "lstm_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 3, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}]}